Repository: UnchartedBull/OctoDash
Catalog: src/locale/messages.*.xlf
Languages: de, fr

# conf-unsaved-message
source: You haven't saved your config yet, so your changes will not be applied. Click close again if you want to discard your changes!
de: Die Konfiguration wurde noch nicht gespeichert, daher werden die Änderungen nicht übernommen. Klicke erneut auf Schließen, wenn die Änderungen verworfen werden sollen!
fr: Vous n'avez pas encore enregistré votre configuration, vos modifications ne seront donc pas appliquées. Cliquez à nouveau sur Fermer si vous souhaitez annuler vos modifications !

# error-invalid-config
source: Can't save invalid config
de: Invalide Konfiguration!
fr: Impossible d'enregistrer une configuration non valide

# octoprint-sleeping
source: Shhh! OctoDash is sleeping.
de: Shhh! OctoDash schläft.
fr: Chut ! OctoDash dort.

# octoprint-sleeping-message
source: Tap the screen to wake me up again.
de: Berühre den Bildschirm zum aufwachen.
fr: Appuyez sur l'écran pour me réveiller à nouveau.

source: connecting
de: verbinden
fr: connexion en cours

# connection-failed
source: Connection can't be established. Press screen to try again.
de: Verbindung kann nicht hergestellt werden. Berühre den Bildschirm um es erneut zu versuchen.
fr: La connexion ne peut pas être établie. Appuyez sur l'écran pour réessayer.

source: downloading update
de: Update herunterladen
fr: téléchargement de la mise à jour

# update-minutes-left
source: minutes left
de: minuten übrig
fr: minutes restantes

source: installing update
de: Update installieren
fr: installation de la mise à jour

# update-wait
source: this might take a while
de: das kann ein paar Minuten dauern
fr: cela peut prendre un certain temps

# update-confirmation
source: v {{ service.latestVersion }} installed
de: v installieret

# error-update
source: Can't initiate update!
de: Update kann nicht gestartet werden!
fr: Impossible de lancer la mise à jour !

# error-update-message
source: Some information is missing, please try again in an hour or update manually.
de: Es fehlen Informationen, bitte versuche es in einer Stunde nochmal.
fr: Certaines informations sont manquantes, veuillez réessayer dans une heure ou mettre à jour manuellement.

# error-install-update
source: Can't install update!
de: Update kann nicht installiert werden!

# website-loading
source: loading website...
fr: chargement du site Web ...

# action-icon
source: Icon
fr: Icône

# octodash-custom-icon-attribution
source: Icons come from FontAwesome's free Classic Solid pack
fr: Les icônes proviennent du pack gratuit Classic Solid de FontAwesome

# ui-delete
source: delete
fr: supprimer

# ui-close
source: close
fr: fermer

# error-custom-action-invalid
source: Unknown special command!
fr: Commande spéciale inconnue !

# error-custom-action-invalid-desc
source: The special command you have entered is unknown.
fr: La commande spéciale que vous avez saisie est inconnue.

# error-custom-action-disabled
source: Printer commands are not available!
fr: Les commandes de l'imprimante ne sont pas disponibles !

# error-custom-action-disabled-desc
source: Please connect to your printer first before attempting to use a printer command.
fr: Veuillez d'abord vous connecter à votre imprimante avant d'essayer d'utiliser une commande d'imprimante.

# long-init
source: Initializing is taking longer than usual... Please make sure that OctoPrint is running and that CORS is enabled for the API.
fr: L'initialisation prend plus de temps que d'habitude. Veuillez vous assurer qu'OctoPrint est opérationnel.

# follow-printer-screen
source: follow the instructions on your printer's display
fr: suivez les instructions sur l'affichage de votre imprimante

# ui-waiting-for-user
source: I'll wait for you.
fr: Je vous attends.

# ui-done
source: done
fr: terminé

# choose-tool
source: select tool
fr: sélectionner l'outil

# tool-selection
source: Tool {{ i }}
fr: Outil {{ i }}

# nozzle-heating-start
source: start
fr: lancer

# move-filament-stop
source: stop
fr: arrêter

# files-name
source: Name
fr: Nom

# ui-loading-info
source: loading info
fr: informations sur le chargement

# ui-yes
source: yes
fr: oui

# ui-no
source: no
fr: non

# adjust-hotend
source: Hotend
fr: Buse

# reset-confirmation
source: Are you sure you want to reset the configuration?
fr: Êtes-vous sûr de vouloir réinitialiser la configuration ?

# ui-save
source: save
fr: enregistrer

# general-name
source: Name
fr: Nom

# default-hotend
source: Hotend (°C)
fr: Buse (°C)

# general-feedlength
source: Feed Length (mm)
fr: Longueur d'alimentation (mm)

# general-purge-distance
source: Purge Distance (mm)
fr: Distance de purge (mm)

# general-feedrate
source: Feed Speed (mm/s)
fr: Vitesse d'alimentation (mm/s)

source: Show extruder controls
fr: Afficher les commandes de l'extrudeuse

# show-action-center-icon
source: Show icon for Action Center
fr: Afficher l'icône du Centre d'action

# preview-progress-circle
source: Always use circular progress bar
fr: Toujours utiliser une barre de progression circulaire

# default-directory
source: Default directory for file browser
fr: Répertoire par défaut du navigateur de fichiers

# settings-display-layer-progress
source: Display Layer Progress
fr: Afficher la progression de la couche

# ui-enabled
source: enabled
fr: activé

# settings-enclosure
source: Enclosure
fr: Enceinte

# about-developer-mode
source: updates disabled (dev mode)
fr: mises à jour désactivées (mode dev)

# about-install-v
source: install {{ service.latestVersion.title }}
fr: installer {{ service.latestVersion.title }}

source: Connection
fr: Connexion

source: Reset Config
fr: Réinitialiser la config

# prompt-feed-length
source: Feed Length:
fr: Longueur d'alimentation :

# prompt-feed-speed
source: Feed Speed:
fr: Vitesse d'alimentation :

source: API Key:
fr: Clé API :

# prompt-customization-details
source: Now tell me some facts about your setup so I can personalize OctoDash for you.
fr: Maintenant, donnez-moi quelques informations sur votre configuration afin que je puisse personnaliser OctoDash pour vous.

source: Use Touchscreen
fr: Utiliser l'écran tactile

# checking-octoprint-connection
source: OctoPrint Connection
fr: Connexion OctoPrint

# checking-config
source: Validating Config
fr: Validation de la configuration

# checking-save
source: Saving Config
fr: Enregistrement de la configuration

# ui-back
source: back
fr: retour

# ui-next
source: next
fr: suivant

# update-confirmation
source: v {{ service.latestVersion.version }} installed
fr: v {{ service.latestVersion.version }} installée

# update-restart
source: would you like to restart OctoDash now?
fr: voulez-vous redémarrer OctoDash maintenant ?

# update-available-long
source: Version this.latestVersion.title is available. Go to Settings > About to update.
fr: Version this.latestVersion.title est disponible. Allez dans Paramètres &gt ; À propos de pour mettre à jour.

# error-run-enclosure-shell
source: Can't run enclosure shell!
fr: Impossible d'exécuter le shell de clôture !

# error-send-psu-command
source: Can't send plug command!
fr: Impossible d'envoyer une commande de fiche !

# octoprint-upgrade-required-title
source: OctoPrint outdated!
fr: OctoPrint dépassé !

# octoprint-upgrade-required-long
source: OctoPrint must be running at least minimumVersion; currently running info.server.
fr: OctoPrint doit fonctionner au minimum minimumVersion ; actuellement en cours d'exécution info.server.

# error-printer-set-tool
source: Can't set active tool!
fr: Impossible de régler l'outil actif !

# http-403-heading
source: HTTP Error 403 - FORBIDDEN
fr: Erreur HTTP 403 - INTERDIT

# http-403-text
source: This most likely means that your API Key is invalid. Please update the API Key and restart your system.
fr: Cela signifie probablement que votre clé API n'est pas valide. Veuillez mettre à jour la clé API et redémarrer votre système.

# http-unknown-heading
source: Unknown HTTP Error
fr: Erreur HTTP inconnue
