Repository: UnchartedBull/OctoDash
Catalog: src/locale/messages.*.xlf
Languages: de, fr

# long-init
source: Initializing is taking longer than usual. Please make sure that OctoPrint is running and that CORS is enabled for the API.
de: Initialisieren dauert länger als erwartet. Bitte stelle sicher das OctoPrint läuft und CORS für die API aktiviert ist.

source: initializing
de: initialisieren
fr: initialisation

source: Update available!
de: Aktualisierung verfügbar!
fr: Mise à jour disponible !

# error-load-style
source: Can't load custom styles!
de: Kann angepasste styles nicht laden!
fr: Impossible de charger les styles personnalisés !

# error-enclosure-temp
source: Can't retrieve enclosure temperature!
de: Kann Gehäuse Temperature nicht laden!
fr: Impossible de récupérer la température de l'enceinte !

# error-restart
source: Please restart your system. If the issue persists open an issue on GitHub.
de: Bitte System neu starten. Sollte der Fehler bestehen bleiben öffne bitte ein Ticket auf GitHub.

# invalid-config
source: Your config is invalid!
de: Konfiguration enthält Fehler.
fr: Votre configuration est invalide !

# correct-errors
source: Please correct the errors listed below!
de: Bitte korrigieren die unten aufgeführten Fehler!
fr: Veuillez corriger les erreurs répertoriées ci-dessous !

# select-instance
source: First things first: Please select your OctoPrint instance from the list below or enter the IP/URL manually.
de: Das Wichtigste zuerst: Bitte wähle deine OctoPrint-Instanz aus der Liste unten oder gebe die IP/URL manuell ein.

# version-url
source: Version {{ node.version }}, URL: {{ node.url }}
de: Version, URL:

source: searching
de: suchen

source: enter manually
de: manuell eingeben

# port-recommendation
source: Port 5000 for vanilla OctoPrint, Port 80 for OctoPi
de: Port 5000 für Standardinstallation, Port 80 für OctoPi

source: search again
de: erneut suchen

# connect-localhost
source: connect to localhost?
de: mit localhost verbinden?

# prompt-same-machine
source: are you trying to connect to OctoPrint that is running on the same machine as OctoDash?
de: Versuchst du eine Verbindung zu OctoPrint herzustellen, welches auf demselben Rechner wie OctoDash läuft?

# no-instance-found
source: no instances found.
de: keine Instanzen gefunden

# prompt-extruder-info
source: I also need some information about your extruder.
de: Ich brauche auch einige Informationen über den Extruder.
fr: J'ai également besoin d'informations sur votre extrudeur.

# filament-changing-warning
source: These values are used for filament changing. Make sure to have your feed length (distance extruder to hotend) and feed speed configured correctly.
de: Diese Werte werden für den Filamentwechsel verwendet. Stelle sicher, dass die Feed Length (Abstand Extruder zu Hotend) und der Feed Speed richtig konfiguriert sind.
fr: Ces valeurs sont utilisées pour le changement de filament. Assurez-vous que la longueur d'alimentation (distance entre l'extrudeur et la buse) et la vitesse d'alimentation sont configurées correctement.

# prompt-auth
source: Please authenticate me now. You can either click the button below and confirm the request in your OctoPrint webinterface or enter an API Key manually.
de: Bitte authentifiziere mich jetzt. Klicke dazu entweder auf die Schaltfläche unten um die Anfrage an das OctoPrint Webinterface zu schicken oder gebe den API-Schlüssel manuell ein.
fr: Veuillez m'authentifier maintenant. Vous pouvez soit cliquer sur le bouton ci-dessous et confirmer la demande dans votre interface Web OctoPrint, soit entrer une clé API manuellement.

source: send request
de: Anfrage senden
fr: envoyer la demande

# octoprint-connection-failed
source: Can't connect to OctoPrint!
de: Kann keine Verbindung zu OctoPrint herstellen!
fr: Impossible de se connecter à OctoPrint !

# octoprint-connection-failed-message
source: Check the URL/IP and make sure that your OctoPrint instance is reachable from this device.
de: Überprüfen Sie die URL/IP und stellen Sie sicher, dass Ihre OctoPrint-Instanz von diesem Gerät aus erreichbar ist.
fr: Vérifiez l'URL / IP et assurez-vous que votre instance OctoPrint est accessible à partir de cet appareil.

# unsupported-autologin
source: Automatic login not supported!
de: Automatischer Login nicht unterstützt!
fr: Connexion automatique non prise en charge !

# manually-create-api-key
source: Please create the API Key manually and paste it in the bottom field.
de: Bitte erstelle den API-Schlüssel manuell und fügen ihn in das Feld ein.
fr: Veuillez créer la clé API manuellement et la coller dans le champ du bas.

# login-request-sent
source: Login request send!
de: Anmeldungsanfrage gesendet!
fr: Demande de connexion envoyée !

# login-request-sent-message
source: Please confirm the request via the popup in the OctoPrint WebUI.
de: Bitte bestätige die Anfrage über das Popup im OctoPrint WebUI.
fr: Veuillez confirmer la demande via la fenêtre contextuelle de l'interface Web OctoPrint.

# prompt-customization-details
source: Now tell me some facts about your setup so I can personalize OctoDash for you.
de: Erzählen mir jetzt etwas mehr über dein System, damit ich OctoDash für dich anpassen kann.

# prompt-printer-name
source: Printer Name:
de: Druckername:
fr: Nom de l'imprimante :

source: Use Touchscreen
de: Touchscreen verwenden

# change-settings-info
source: You can change all settings (and even more) in the settings menu anytime. There is also a description of each attribute available in the GitHub Wiki.
de: Du kannst alle Einstellungen (und noch mehr) jederzeit im Einstellungsmenü ändern. Im GitHub Wiki findest du Beschreibungen zu den Attributen.
fr: Vous pouvez modifier tous les paramètres (et même plus) dans le menu des paramètres à tout moment. Il existe également une description de chaque attribut disponible dans le wiki GitHub.

# prompt-plugins
source: What plugins are you running?
de: Welche Plugins hast du installiert?
fr: Quels plugins utilisez-vous ?

# setup-back
source: back
de: zurück

# setup-next
source: next
de: nächster Schritt

# checking
source: Great! I'll check everything.
de: Sehr gut! Ich überprüfe alles.
fr: Génial ! Je vais tout vérifier.

# checking-octoprint-connection
source: OctoPrint Connection
de: OctoPrint Verbindung

# checking-config
source: Validating Config
de: Konfiguration validieren

# checking-save
source: Saving Config
de: Konfiguration speichern

# wizard-done
source: done
de: fertig
fr: terminé

source: saving config
de: Konfiguration speicher
fr: enregistrement de la configuration

# error-403
source: 403 Forbidden - This most likely means that your API Key isn't working.
de: 403 Forbidden - Das bedeutet höchstwahrscheinlich, dass der API-Schlüssel nicht funktioniert.
fr: 403 Interdit - Cela signifie très probablement que votre clé API ne fonctionne pas.

# error-unknown
source: 0 Unknown Error - This most likely means that your OctoPrint host and port aren't correct.
de: 0 Unbekannter Fehler - Das bedeutet höchstwahrscheinlich, dass der OctoPrint Host und/oder Port nicht korrekt sind.
fr: 0 Erreur inconnue - Cela signifie très probablement que votre hôte et votre port OctoPrint ne sont pas corrects.

# welcome-1
source: It looks like this is the first start of OctoDash.
de: Es sieht so aus, als ob dies der erste Start von OctoDash ist.
fr: Il semble que ce soit le premier démarrage d'OctoDash.

# welcome-2
source: I'll help you set up your config and get you started.
de: Ich helfe dir bei der Einrichtung mache OctoDash startklar.
fr: Je vais vous aider à préparer votre configuration et démarrer.

# welcome-3
source: If you encounter any issues please check the troubleshooting guide in the GitHub Wiki.
de: Wenn du auf Probleme stößt, lesen bitte die Anleitung zur Fehlerbehebung im GitHub-Wiki.
fr: Si vous rencontrez des problèmes, veuillez consulter le guide de dépannage dans le wiki GitHub.

# welcome-4
source: Note: you will need to connect a keyboard for the setup process
de: Danke, dass du dich für OctoDash entschieden hast
fr: Merci d'avoir choisi OctoDash

# welcome-5
source: Sorry for bothering you again ...
de: Tut mir leid, dass ich nochmal störe ...
fr: Désolé de vous déranger à nouveau ...

# welcome-6
source: We've released an update, so awesome, we needed to change the config. Please review your new config!
de: Wir haben ein Update veröffentlicht, das so toll ist, dass wir Teile der Konfiguration ändern mussten. Bitte überprüfe deine neue Konfiguration!
fr: Nous avons publié une mise à jour, tellement géniale que nous avons dû modifier la configuration. Veuillez vérifier votre nouvelle configuration !

# welcome-7
source: Thanks for choosing OctoDash
de: Danke, dass du dich für OctoDash entschieden hast
fr: Merci d'avoir choisi OctoDash

# control-back
source: back
de: zurück

# error-printer-profile
source: Can't retrieve printer profile!
de: Druckerprofil kann nicht abgerufen werden!
fr: Impossible de récupérer le profil de l'imprimante !

# website-loading
source: loading website ...
de: lade website ...

# should-not-happen
source: That shouldn't happen ...
de: Das sollte nicht passieren ...

source: are you sure?
de: Bist du dir sicher?
fr: souhaitez-vous continuer ?

# confirm-exec
source: do you want to execute the following command?
de: möchtest Du den folgenden Befehl ausführen?
fr: voulez-vous exécuter la commande suivante ?

# load-new-filament
source: load new filament into tool {{ selectedTool }}
de: neues Filament laden
fr: charger un nouveau filament {{ selectedTool }}

# load-new-filament-message
source: only put a little filament in, I'll pull in the rest.
de: nur ein wenig Filament einlegen, den Rest ziehe ich ein.
fr: il suffit de mettre un peu de filament, je vais tirer le reste.

# filament-grams-left
source: g left
de: g übrig
fr: g restants

# filament-done
source: done
de: fertig

# filament-waiting
source: I'll wait for you.
de: Ich warte auf dich.

# filament-m600
source: M600 sent
de: M600 gesendet
fr: M600 envoyé

# follow-printer-screen
source: follow the instructions on your printers' display
de: Folge den Anweisung auf dem Display deines Druckers

# choose-filament
source: select your new filament
de: Wähle dein neues Filament aus
fr: sélectionnez votre nouveau filament

# choose-filament-grams-left
source: g left
de: g übrig
fr: g restants

# no-spools
source: no filament spools found
de: Keine Filament Rollen gefunden
fr: aucune bobine de filament trouvée

source: loading spools
de: laden Filamente
fr: chargement des bobines

# filament-back
source: back
de: zurück

# filament-skip
source: skip
de: überspringen

# nozzle-heating
source: heating the nozzle for tool {{ selectedTool }}
de: Nozzle aufheizen
fr: préchauffage de la buse {{ selectedTool }}

# nozzle-heating-wait
source: wait
de: warten
fr: attendre

# nozzle-heating-wait-seconds-or
source: s or
de: s oder
fr: s ou

# loading-filament
source: loading
de: laden
fr: chargement

# unloading-filament
source: unloading
de: entladen
fr: déchargement

source: purging filament
de: Nozzle reinigen
fr: purge du filament

# purging-done
source: done
de: fertig
fr: terminé

# files-back
source: back
de: zurück

# files-top-sort
source: sort
de: sortieren

# files-loading
source: loading details
de: lade Details
fr: chargement des informations

# files-sort
source: sort files
de: Dateien sortieren
fr: trier les fichiers

# files-sort-by
source: sort by
de: Sortieren nach
fr: trier par

# files-date
source: Date
de: Datum

# files-size
source: Size
de: Größe
fr: Taille

# files-order
source: order
de: Sortierung
fr: ordre

# files-ascending
source: Ascending
de: Aufsteigend
fr: Croissant

# files-descending
source: Descending
de: Absteigen
fr: Décroissant

# error-load-file-folder
source: Can't load file/folder!
de: Datei / Ordner kann nicht gefunden werden!
fr: Impossible de charger le fichier/dossier !

# error-load-file
source: Can't load file!
de: Datei kann nicht gefunden werden!
fr: Impossible de charger le fichier !

# height-of
source: of
de: von

# job-info__time-left
source: left,
de: übrig,

# job-elapsed
source: elapsed:
de: vergangen:

source: - will finish ~
de: - - wird fertig sein ~

# filament-used
source: filament will be used
de: Filament benötigt

source: loading info
de: lade Details

# no-job
source: no job running ...
de: kein Druck läuft

# menu-files
source: files
de: Dateien
fr: fichiers

# menu-control
source: control
de: Steuerung
fr: contrôles

source: no new notifications.
de: Keine neuen Benachrichtigungen

# tap-close
source: tap this card to close it
de: Tippe auf diese Karte um sie zu schließen
fr: touchez cette carte pour la fermer

# control-cancel
source: cancel
de: Abbrechen
fr: annuler

# control-pause
source: pause
de: Pausieren

# control-adjust
source: adjust
de: Anpassen
fr: régler

source: cancel print?
de: Druck abbrechen?
fr: annuler l'impression ?

# cancel-yes
source: yes
de: ja

# cancel-no
source: no
de: nein

# pause-back
source: back
de: zurück

# print-pause
source: print paused
de: Druck pausiert
fr: impression en pause

# print-restart
source: restart
de: neustarten
fr: redémarrer

# print-resume
source: resume
de: fortfahren
fr: continuer

# adjust-back
source: back
de: zurück

# adjust-heatbed
source: Heatbed
de: Heizbett
fr: Lit chauffant

# adjust-fanspeed
source: Fan Speed
de: Lüfter Geschwindigkeit
fr: Ventilateur

# adjust-speed
source: Speed
de: Geschwindigkeit
fr: Vitesse

# offset-save
source: save
de: speichern

# babystep-back
source: back
de: zurück

source: Babystep Z
de: Babysteo Z

# babystep-mm
source: mm
de: nmm

# error-set-color
source: Can't set LED color!
de: LED Farbe kann nicht gesetzt werden!
fr: Impossible de définir la couleur des LED !

# error-set-output
source: Can't set output!
de: Output kann nicht gesetzt werden!
fr: Impossible de définir la sortie !

# error-psu-state
source: Can't change PSU State!
de: Netzteil Status kann nicht geändert werden!
fr: Impossible de changer l'état du bloc d'alimentation !

# error-psu-provider
source: No provider for PSU Control is configured.
de: Es ist kein Provider für PSU Control konfiguriert.
fr: Aucun fournisseur pour PSU Control n'est configuré.

# error-send-psu-gcode
source: Can't send GCode!
de: GCode kann nicht gesendet werden!
fr: Impossible d'envoyer le GCode !

# error-send-ophom-gcode
source: Can't update Ophom Plug!
de: Ophom Stecker kann nicht geändert werden!
fr: Impossible de mettre à jour Ophom Plug !

# error-send-smartplug-gcode
source: Can't send GCode!
de: Gcode kann nicht gesendet werden!
fr: Impossible d'envoyer le GCode !

# error-send-tasmota-plug
source: Can't update Tasmota!
de: Tasmota Stecker kann nicht geändert werden!
fr: Impossible de mettre à jour Tasmota !

# error-send-tasmota-plug-mqtt
source: Can't update Tasmota MQTT!
de: Tasmota Stecker kann nicht geändert werden!
fr: Impossible de mettre à jour Tasmota MQTT !

# error-spools
source: Can't load filament spools!
de: Filament Rollen können nicht geladen werden!
fr: Impossible de charger les bobines de filament !

# error-spool
source: Can't load active spool!
de: Aktive Filament Rolle kann nicht geladen werden!
fr: Impossible de charger la bobine active!

# error-spool-id
source: Spool IDs didn't match
de: Filament ID stimmt nicht überein
fr: Les ID des bobines ne correspondent pas

# error-change-spool
source: Can't change spool. Please change spool manually in the OctoPrint UI.
de: Filament kann nicht gewechselt werden, bitte manuell im OctoPrint UI wechseln.
fr: Impossible de changer la bobine. Veuillez changer la bobine manuellement dans l'interface utilisateur d'OctoPrint.

# error-set-new-spool
source: Can't set new spool!
de: Neues Filament kann nicht gespeichert werden!
fr: Impossible de définir une nouvelle bobine !

# error-set-new-spool-2
source: Can't set new spool!
de: Neues Filament kann nicht gespeichert werden!
fr: Impossible de définir une nouvelle bobine !

source: local
de: lokal

source: sdcard
de: SD Karte

# files-error-file
source: Can't load file!
de: Datei kann nicht geladen werden!
fr: Impossible de charger le fichier !

# files-error-print
source: Can't start print!
de: Druck kann nicht gestartet werden!
fr: Impossible de démarrer l’impression !

# files-error-delete
source: Can't delete file!
de: Datei kann nicht gelöscht werden!
fr: Impossible de supprimer le fichier !

# error-start-job
source: Can't start job!
de: Druck kann nicht gestartet werden!
fr: Impossible de démarrer l'impression !

# error-pause-job
source: Can't pause job!
de: Druck kann nicht pausiert werden!
fr: Impossible de suspendre l'impression !

# error-resume-job
source: Can't resume job!
de: Druck kann nicht fortgesetzt werden!
fr: Impossible de reprendre l'impression !

# error-cancel-job
source: Can't cancel job!
de: Druck kann nicht abgebrochen werden!
fr: Impossible d'annuler l'impression !

# error-restart-job
source: Can't restart job!
de: Druck kann nicht neugestartet werden!
fr: Impossible de redémarrer l'impression !

# error-preheat
source: Can't preheat printer!
de: Drucker kann nicht vorgeheizt werden!
fr: Impossible de préchauffer l'imprimante !

# printer-error-gcode
source: Can't send GCode!
de: GCode kann nicht gesendet werden!
fr: Impossible d'envoyer le GCode !

# error-printer-head
source: Can't move Printhead!
de: Druckkopf kann nicht bewegt werden!
fr: Impossible de déplacer la tête d'impression !

# error-printer-extrude
source: Can't extrude Filament!
de: Filament kann nicht extrudiert werden!
fr: Impossible d'extruder le filament !

# error-printer-hotend
source: Can't set Hotend Temperature!
de: Hotend Temperatur kann nicht gesetzt werden!
fr: Impossible de régler la température de la buse !

# error-printer-bed
source: Can't set Bed Temperature!
de: Heizbett Temperatur kann nicht gesetzt werden!
fr: Impossible de régler la température du lit !

# error-printer-feedrate
source: Can't set Feedrate!
de: Feedrate kann nicht gesetzt werden!
fr: Impossible de définir la vitesse d'alimentation !

# error-printer-flowrate
source: Can't set Flowrate!
de: Flowrate kann nicht gesetzt werden!
fr: Impossible de régler le débit !

# error-printer-disconnect
source: Can't disconnect Printer!
de: Verbindung zum Drucker kann nicht aufgelöst weden!
fr: Impossible de déconnecter l'imprimante !

source: Printer error
de: Drucker Fehler
fr: Erreur d'imprimante

source: Action required
de: Aktion erforderlich
fr: Action requise

# error-answer-prompt
source: Can't answer prompt!
de: Kann nicht antworten!
fr: Impossible de répondre à la demande!

# error-execute
source: Can't execute command command!
de: Kommando kann nicht ausgeführt werden!
fr: Impossible d'exécuter la commande command!

# error-connect
source: Can't connect to printer!
de: Verbindung zum Drucker kann nicht aufgebaut werden!
fr: Impossible de se connecter à l'imprimante !

source: settings
de: Einstellungen
fr: réglages

# settings-general
source: general
de: Generell
fr: général

# settings-about
source: about
de: Info
fr: à propos

# settings-general-menu
source: general
de: Generell
fr: général

# general-octoprint-connection
source: OctoPrint Connection
de: OctoPrint Verbindung
fr: Connexion OctoPrint

# general-printer
source: Printer
de: Drucker
fr: Imprimante

# general-xyspeed
source: XY-Speed (mm/s)
de: XY-Geschwindigkeit (mm/s)
fr: Vitesse XY (mm/s)

# general-zspeed
source: Z-Speed (mm/s)
de: Z-Geschwindigkeit (mm/s)
fr: Vitesse Z (mm/s)

# general-default
source: Default Temperatures & Fan Speed
de: Standard Temperaturen & Lüftergeschwindigkeit
fr: Températures et vitesse par défaut du ventilateur

# default-heatbed
source: Heatbed (°C)
de: Heizbett (°C)
fr: Lit chauffant (°C)

# default-fanspeed
source: Fan Speed (%)
de: Lüftergeschwindigkeit (%)
fr: Vitesse du ventilateur (%)

# general-m600
source: Use M600 to change Filament
de: Filament mit M600 wechseln
fr: Utiliser M600 pour changer de filament

# general-feedrate-slow
source: Feed Speed Slow (mm/s)
de: Feed Speed Langsam (mm/s)
fr: Vitesse d'alimentation Lente (mm/s)

# general-thickness
source: Thickness (mm)
de: Dicke (mm)
fr: Épaisseur (mm)

# general-density
source: Density (g/cm³)
de: Dichte (g/cm³)
fr: Densité (g/cm³)

# general-warning
source: Please set these values carefully, as they possibly can destroy parts of your printer, just don't set your Feed Speed to high and your Feed Length to long.
de: Bitte stellen die Werte sorgfältig ein, da sie unter Umständen Teile des Druckers zerstören können, stellen den Feed Speed nicht zu hoch und die Feed Length nicht zu lang ein.
fr: Veuillez définir ces valeurs avec soin, car elles pourraient endommager certaines parties de votre imprimante. Ne réglez pas simplement votre vitesse d'alimentation sur rapide et votre longueur d'alimentation sur longue.

# octodash-general
source: General
de: Generell
fr: Général

# screen-off
source: Turn screen off while sleeping
de: Display im Standby ausschalten
fr: Éteindre l'écran pendant la veille

# turn-on-after-sleep
source: Turn on printer when exiting sleep
de: Drucker beim Wechsel aus dem Standby einschalten
fr: Allumer l'imprimante en sortie de veille

# default-preview
source: Preview by default while printing
de: Vorschau als Standard
fr: Aperçu par défaut lors de l'impression

# always-circular
source: Always use circular progress bar
de: Immer runde Fortschrittsanzeige verwenden

source: Invert Axis Control
de: Achsen Kontrolle invertieren
fr: Inversion des axes

# octodash-gcode
source: GCode / Action
de: GCode / Aktion

# action-color
source: Color
de: Farbe
fr: Couleur

# action-confirm
source: Confirm
de: Bestätigung erforderlich
fr: Confirmer

# action-home
source: Return to Home
de: Automatisch zum Hauptbildschirm zurück
fr: Retourner à la position initiale

# settings-display-layer-progress-enabled
source: enabled
de: aktiviert

# settings-enclosure-enabled
source: enabled
de: aktiviert

# settings-ambiant-sensor
source: Ambient Sensor (ID)
de: Sensor (ID)
fr: Capteur ambiant (ID)

# settings-filament-manager-enabled
source: enabled
de: aktiviert

# settings-spool-manager-enabled
source: enabled
de: aktiviert

# settings-preheat-button-enabled
source: enabled
de: aktiviert

# settings-print-time-genius-enabled
source: enabled
de: aktiviert

# settings-psu-control-enabled
source: enabled
de: aktiviert

# settings-ophom-control
source: Ophon Control (Phillips HUE)
de: Opon Control (Phillips HUE)
fr: Ophon (Phillips HUE)

# settings-ophom-control-enabled
source: enabled
de: aktiviert

# settings-tplink-smartplug-enabled
source: enabled
de: aktiviert

source: about
de: Info
fr: à propos

# about-no-update
source: up to date
de: Keine Aktualisierung verfügbar
fr: pas de mise à jour disponible

# about-install-v
source: install v {{ service.latestVersion.title }}
de: installiere v

# licence
source: License
de: Lizenz
fr: Licence

source: Special Thanks
de: Danksagung
fr: Remerciements spéciaux

# special-thanks-message
source: Special Thanks to /u/Slateclean for supplying touchscreens, so development can continue!
de: Besonderen Dank an /u/Slateclean für die Bereitstellung von Touchscreens, damit die Entwicklung weitergehen kann!
fr: Un merci spécial à /u/Slateclean pour la fourniture d'écrans tactiles, afin que le développement puisse se poursuivre !

source: Top Left
de: Oben Links
fr: Haut gauche

source: Top Right
de: Oben Rechts
fr: Haut droit

source: Middle Left
de: Mitte Links
fr: Milieu gauche

source: Middle Right
de: Mitte Rechts
fr: Milieu droit

source: Bottom Left
de: Unten Links
fr: Bas gauche

source: Bottom Right
de: Unten Rechts
fr: Bas droit

# conf-unsaved
source: Configuration not saved!
de: Konfiguration nicht gespeichert!
fr: Configuration non enregistrée !
